Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/becoming_an_irish_citizen_through_naturalisation.html.txt.tmx
Source language: en
Languages: ga

source: If your application for naturalisation is based on your relationship to an Irish citizen, you will need to produce the documents needed to show that person's status and your relationship to that person (for example birth or naturalisation certificate of Irish spouse, marriage certificate, civil partnership certificate)
ga: Má tá d'iarratas ar eadóirseacht bunaithe ar an ngaol atá agat le saoránach Éireannach, caithfidh tú na cáipéisí faoi stádas an duine sin agus faoin ngaol atá agat leis a thaispeáint (mar shampla teastas breithe nó eadóirseachta ag céile nó páirtnéir sibhialta Éireannach, teastas pósta, teastas páirtnéireachta sibhialta)

source: The copies of birth, marriage, civil partnership, divorce and other certificates, such as the photo page of your passport, must be certified documents
ga: Caithfidh na cóipeanna de na teastais bhreithe, pósta, páirtnéireachta sibhialta, colscartha agus teastais eile, mar shampla an fótaleathanach do phas, bheith cáipéisí deimhnithe

source: You will be expected to produce the original documents for inspection at a later stage during the examination of your application
ga: Beidh dúil go mbeidh sé i do chumas na bundindiúirí a thaispeáint níos faide anonn nuair a táthar ag scrúdú d'iarratais

source: As well as these documents, if you are 18 or over and applying for naturalisation, you must produce documents relevant to your financial and employment status (copies of 3 pay slips and 3 bank statements dated within the previous 6 months) and confirmation of your income tax situation
ga: Chomh maith leis na cáipéisí seo, caithfidh tú cáipéisí a thaispeáint maidir le do stádas fostaíochta (duillíní pá le haghaidh na 3 mí deireanach, ráitis bhainc le haghaidh na 3 mí a chuaigh thart) agus dearbhú faoi do staid maidir le cáin ioncaim

source: You should only send copies of the above documents with your application form
ga: Níor cheart ach cóipeanna amháin de na rudaí seo a sheoladh i dteannta le d'fhoirm iarratais

source: The information in your application form will be checked against the supporting documentation and any inaccuracy will lead to delays in ruling on your application
ga: Seiceálfar an t-eolas i d'fhoirm iarratais le hais na gcáipéis lena cois agus beidh moill ann mar thoradh ar aon mhí-chruinneas maidir le cinneadh a thabhairt ar d'iarratas

source: You should not sign the form until you are in the presence of the person who must witness you signing it
ga: Níor cheart ainm a chur leis an bhfoirm go dtí go mbeidh tú i láthair finné

source: The application form contains instructions about who is eligible to be a witness
ga: Tá eolas ar an bhfoirm iarratais maidir le cé atá i dteideal a bheith mar fhinné

source: Lost or stolen certificate of naturalisation
ga: Teastas eadóirseachta caillte nó goidte

source: If your certificate of naturalisation is lost or stolen, you should write to the Citizenship Division of INIS – see ‘Where to apply’ below
ga: Má tá do theastas eadóirseachta caillte nó goidte, ba chóir duit scríobh chuig an Rannóg Saoránacht – féach ‘Cá háit a ndéanfaidh mé iarratas’

source: You will not get a replacement certificate but instead you will be given a statement confirming your Irish citizenship
ga: Ní fhaigheann tú athchur teastais, ach tabharfar ráiteas a dheimhníonn do shaoránacht Éireannach

source: There is no fee for this service
ga: Níl aon táille le haghaidh na seirbhíse seo

source: If you are applying for an Irish passport you will need this statement to accompany your passport application
ga: Má dhéanann tú iarratas ar phas Éireannach, is gá duit an ráiteas seo chun gabháil le d’iarratas

source: New applications for minors (Form 9, 10 or 11) should be sent to Citizenship Applications, Irish Naturalisation and Immigration Service, PO Box 12079, Dublin 1
ga: Ní mór iarratais nua le haghaidh leanaí mionaoiseacha (Foirm 9, 10 nó 11) a sheol chuig Iarratais ar Shaoránacht, Seirbhís Eadóirseachta agus Inimirce na hÉireann, Bosca Poist 12079, Baile Átha Cliath 1

source: Note: this address is only for lodging new applications
ga: Nóta: ní bhaineann an seoladh ach amháin le hiarratais nua

source: All other correspondence for minors should be sent to the address on the letter sent to you
ga: Bá chóir an uile chomhfhreagras eile a sheol chuig seoladh an litir a sheoladh chugat

source: New applications for adults (form 8) should be sent to Citizenship Applications, Irish Naturalisation and Immigration Service, PO Box 73, Tipperary Town
ga: Ní mór iarratais nua le haghaidh duine fásta (Foirm 8) a sheol chuig Iarratais ar Shaoránacht, Seirbhís Eadóirseachta agus Inimirce na hÉireann, Bosca Poist 73, Baile Thiobraid Áran

source: All other citizenship correspondence should be sent to Citizenship Division – see below
ga: Bá chóir an uile chomhfhreagras eile a sheol chuig Rannóg Saoránacht - féach thíos
